{"vocabulary": {"espn": 927, "com": 554, "byu": 435, "star": 2460, "suffers": 2523, "season": 2289, "ending": 904, "torn": 2641, "acl": 95, "suffered": 2520, "saturday": 2270, "win": 2841, "career": 458, "espn com": 928, "torn acl": 2642, "wsj": 2885, "super": 2527, "bowl": 383, "revenge": 2192, "nfl": 1760, "critics": 733, "championship": 495, "talk": 2560, "team": 2580, "wsj com": 2886, "super bowl": 2528, "sport": 2432, "olympics": 1815, "doing": 828, "broke": 400, "ice": 1284, "went": 2829, "right": 2203, "skating": 2378, "canada": 447, "dead": 761, "mass": 1598, "shooting": 2351, "suspected": 2540, "shooter": 2350, "self": 2311, "attack": 251, "secondary": 2300, "school": 2281, "home": 1259, "com canada": 578, "jesse": 1380, "jackson": 1365, "civil": 520, "rights": 2204, "activist": 100, "political": 1977, "leader": 1456, "died": 806, "84": 78, "black": 347, "man": 1575, "presidential": 2015, "campaign": 445, "public": 2058, "minister": 1657, "known": 1424, "interests": 1335, "working": 2875, "people": 1914, "especially": 926, "com jesse": 597, "jesse jackson": 1381, "civil rights": 521, "names": 1712, "chief": 507, "successor": 2517, "ceo": 486, "longtime": 1521, "executive": 939, "hand": 1188, "canadian": 449, "telecom": 2595, "giant": 1133, "making": 1571, "way": 2806, "bank": 276, "victor": 2768, "making way": 1573, "ai": 132, "hobby": 1249, "plus": 1963, "tech": 2592, "2026": 37, "moon": 1690, "corporate": 704, "america": 171, "com ai": 559, "corporate america": 705, "opinion": 1837, "washington": 2795, "needs": 1739, "stadium": 2451, "grand": 1163, "greek": 1167, "inspired": 1331, "arena": 226, "capital": 454, "history": 1245, "com opinion": 617, "mission": 1664, "trump": 2682, "europe": 932, "italian": 1362, "trying": 2686, "stop": 2495, "trans": 2661, "atlantic": 249, "rift": 2202, "voters": 2773, "european": 934, "peers": 1907, "alliance": 158, "trans atlantic": 2662, "nytimes": 1780, "ukraine": 2705, "russia": 2247, "hold": 1253, "new": 1745, "round": 2234, "peace": 1903, "talks": 2564, "expectations": 946, "low": 1533, "sides": 2358, "previous": 2020, "negotiations": 1741, "did": 805, "points": 1971, "like": 1493, "territory": 2604, "security": 2305, "nytimes com": 1781, "peace talks": 1904, "bc": 294, "donovan": 841, "father": 993, "bulls": 418, "coach": 537, "dies": 807, "billy": 345, "basketball": 288, "exploits": 957, "propelled": 2048, "boston": 381, "college": 546, "hall": 1185, "fame": 984, "com bc": 568, "bc star": 295, "star donovan": 2464, "donovan father": 843, "father bulls": 994, "bulls coach": 419, "coach dies": 539, "dies donovan": 810, "coach billy": 538, "billy donovan": 346, "donovan basketball": 842, "basketball exploits": 290, "exploits propelled": 958, "propelled boston": 2049, "boston college": 382, "college hall": 549, "hall fame": 1186, "fame died": 985, "said": 2259, "end": 902, "war": 2786, "day": 756, "thought": 2614, "russian": 2248, "attacks": 252, "ukrainian": 2706, "rose": 2228, "president": 2012, "year": 2892, "white": 2832, "house": 1270, "com trump": 635, "trump said": 2685, "war ukraine": 2787, "russian attacks": 2249, "president trump": 2014, "white house": 2833, "learn": 1473, "growing": 1173, "reliance": 2146, "american": 174, "gas": 1103, "looks": 1525, "given": 1138, "morningbrew": 1694, "biggest": 331, "stars": 2471, "drones": 855, "person": 1919, "cameras": 444, "milano": 1648, "cortina": 707, "creating": 727, "good": 1156, "bad": 272, "morningbrew com": 1695, "com biggest": 573, "biggest stars": 333, "milano cortina": 1649, "eurohoops": 929, "net": 1742, "headline": 1207, "preliminary": 2006, "squad": 2444, "germany": 1126, "matchups": 1604, "head": 1203, "named": 1710, "24": 52, "player": 1954, "roster": 2231, "ahead": 130, "february": 1001, "games": 1100, "post": 1989, "appeared": 218, "eurohoops net": 930, "head coach": 1204, "player roster": 1956, "appeared eurohoops": 219, "private": 2030, "bets": 316, "healthcare": 1213, "stephen": 2486, "took": 2640, "stakes": 2456, "investment": 1345, "firm": 1032, "says": 2275, "policies": 1975, "investment firm": 1347, "sports": 2433, "yahoo": 2890, "winter": 2853, "eileen": 887, "gu": 1176, "takes": 2557, "silver": 2364, "medal": 1614, "women": 2861, "freestyle": 1077, "ski": 2382, "big": 325, "air": 145, "defend": 779, "gold": 1148, "2022": 32, "sports yahoo": 2436, "yahoo com": 2891, "com winter": 641, "winter olympics": 2855, "olympics 2026": 1816, "2026 eileen": 40, "eileen gu": 888, "silver medal": 2365, "big air": 327, "gold medal": 1149, "olympian": 1810, "lindsey": 1496, "vonn": 2772, "plans": 1943, "test": 2605, "knee": 1419, "lindsey vonn": 1498, "cbssports": 478, "vs": 2774, "watch": 2800, "champions": 492, "league": 1462, "odds": 1785, "time": 2623, "meet": 1617, "away": 268, "leg": 1485, "playoffs": 1961, "cbssports com": 479, "champions league": 494, "league odds": 1469, "makes": 1569, "mma": 1668, "return": 2179, "set": 2323, "fight": 1012, "nearly": 1736, "decade": 770, "faces": 970, "16": 21, "los": 1526, "angeles": 194, "intuit": 1338, "dome": 832, "los angeles": 1527, "intuit dome": 1339, "early": 862, "slam": 2390, "predictions": 2005, "carlos": 462, "alcaraz": 155, "newly": 1757, "australian": 257, "open": 1825, "majors": 1559, "make": 1560, "com way": 640, "way early": 2807, "grand slam": 1164, "carlos alcaraz": 463, "australian open": 258, "memory": 1623, "consumer": 684, "facing": 972, "prices": 2023, "world": 2876, "companies": 652, "list": 1502, "responses": 2174, "20": 30, "old": 1804, "reach": 2106, "major": 1557, "men": 1624, "year old": 2895, "break": 389, "higher": 1234, "tariffs": 2573, "labor": 1431, "health": 1211, "insurance": 1333, "costs": 711, "pushed": 2066, "businesses": 427, "raise": 2090, "consumers": 687, "prices higher": 2024, "raise prices": 2091, "united": 2723, "states": 2481, "crash": 725, "italy": 1363, "airlifted": 150, "just": 1401, "race": 2086, "united states": 2724, "curry": 743, "point": 1968, "contest": 689, "2027": 48, "winner": 2850, "weekend": 2820, "make return": 1565, "point contest": 1969, "stephen curry": 2487, "star weekend": 2466, "pick": 1929, "financial": 1025, "guide": 1179, "wide": 2834, "services": 2321, "map": 1582, "built": 416, "national": 1717, "powerhouse": 1997, "100": 7, "programs": 2044, "basketball coach": 289, "sales": 2265, "struggles": 2509, "drop": 856, "restaurant": 2175, "fourth": 1064, "quarter": 2076, "business": 425, "fourth quarter": 1065, "summer": 2524, "doesn": 827, "need": 1737, "use": 2739, "power": 1993, "winter games": 2854, "frontofficesports": 1083, "nba": 1726, "views": 2770, "prediction": 2001, "markets": 1597, "betting": 319, "adam": 103, "giannis": 1131, "kalshi": 1403, "stake": 2454, "office": 1796, "frontofficesports com": 1084, "com nba": 612, "prediction markets": 2003, "sports betting": 2434, "adam silver": 104, "silver said": 2366, "post nba": 1990, "appeared office": 220, "office sports": 1797, "rate": 2103, "cap": 452, "stalled": 2457, "billion": 337, "revenue": 2193, "debt": 768, "americans": 182, "weight": 2824, "readers": 2111, "discuss": 814, "trade": 2651, "usa": 2736, "dreams": 848, "record": 2124, "suddenly": 2518, "falling": 981, "apart": 214, "household": 1272, "underperform": 2712, "week": 2817, "yielded": 2900, "golds": 1152, "salvaged": 2268, "com team": 633, "team usa": 2583, "usa dreams": 2738, "dreams record": 849, "record olympics": 2126, "olympics suddenly": 1822, "suddenly falling": 2519, "falling apart": 982, "apart household": 215, "household names": 1273, "names underperform": 1713, "underperform italy": 2713, "italy week": 1364, "week games": 2818, "games yielded": 1102, "yielded golds": 2901, "golds americans": 1153, "americans olympics": 183, "olympics salvaged": 1821, "mlb": 1667, "opening": 1829, "starter": 2475, "tracker": 2650, "red": 2127, "calls": 442, "spring": 2441, "training": 2660, "camps": 446, "opened": 1828, "teams": 2585, "looking": 1524, "regular": 2136, "com 2026": 556, "make early": 1562, "early calls": 863, "spring training": 2442, "hockey": 1250, "tuesday": 2687, "playoff": 1960, "picks": 1932, "expert": 951, "26": 56, "12": 13, "reveals": 2190, "best": 311, "2026 winter": 47, "olympics men": 1819, "men hockey": 1626, "best bets": 312, "starboard": 2467, "dials": 803, "pressure": 2017, "tripadvisor": 2676, "push": 2063, "board": 354, "shake": 2332, "travel": 2668, "site": 2371, "operator": 1835, "stock": 2492, "recently": 2122, "fell": 1005, "quarterly": 2079, "earnings": 865, "missed": 1662, "analyst": 187, "com starboard": 630, "starboard dials": 2468, "dials pressure": 804, "pressure tripadvisor": 2018, "tripadvisor push": 2677, "push board": 2064, "board shake": 359, "shake travel": 2333, "travel site": 2669, "site operator": 2372, "operator stock": 1836, "stock recently": 2493, "recently fell": 2123, "fell quarterly": 1006, "quarterly earnings": 2080, "earnings missed": 867, "missed analyst": 1663, "analyst expectations": 188, "anthropic": 208, "company": 656, "tasked": 2574, "giving": 1139, "chatbot": 500, "claude": 526, "sense": 2315, "wrong": 2884, "com meet": 603, "lxi": 1546, "32": 61, "com super": 632, "nfl team": 1761, "win super": 2844, "bowl lxi": 385, "nfl teams": 1762, "tensions": 2601, "loss": 1528, "drug": 857, "market": 1588, "announced": 198, "thursday": 2619, "sell": 2312, "pill": 1938, "executives": 941, "don": 837, "begin": 300, "understand": 2714, "minutes": 1659, "international": 1336, "tennis": 2597, "wednesday": 2816, "add": 107, "party": 1887, "room": 2227, "thousands": 2616, "fans": 987, "jump": 1400, "nbc": 1731, "game": 1098, "watched": 2803, "years": 2897, "nba star": 1729, "star game": 2465, "nbc appeared": 1732, "real": 2114, "madrid": 1551, "know": 1423, "ex": 938, "benfica": 306, "com real": 624, "real madrid": 2115, "000": 0, "cup": 738, "global": 1141, "soccer": 2404, "expensive": 949, "buying": 434, "experience": 950, "world cup": 2877, "money": 1680, "account": 89, "accounts": 93, "act": 96, "hybrids": 1281, "checking": 502, "savings": 2271, "com money": 608, "money market": 1681, "market account": 1589, "account money": 91, "market accounts": 1590, "accounts act": 94, "act hybrids": 97, "hybrids checking": 1282, "checking savings": 503, "savings accounts": 2272, "lebron": 1478, "future": 1093, "past": 1891, "james": 1366, "sunday": 2525, "ll": 1509, "continue": 690, "playing": 1959, "com lebron": 600, "past year": 1892, "lebron james": 1479, "oil": 1801, "futures": 1094, "mixed": 1666, "focus": 1042, "iran": 1356, "lower": 1535, "returns": 2184, "long": 1514, "long weekend": 1517, "want": 2782, "nuclear": 1777, "arms": 228, "start": 2472, "expired": 953, "finally": 1023, "build": 412, "opinion want": 1840, "new start": 1753, "paul": 1895, "ring": 2205, "turned": 2695, "13": 14, "professional": 2039, "taking": 2558, "true": 2681, "olympic": 1811, "champion": 490, "anthony": 206, "edwards": 884, "doncic": 840, "play": 1951, "luka": 1542, "nikola": 1765, "anthony edwards": 207, "luka doncic": 1543, "24 year": 54, "ncaa": 1733, "cause": 476, "penalty": 1911, "appeal": 217, "committee": 647, "denied": 791, "michigan": 1635, "football": 1048, "staff": 2452, "member": 1620, "involvement": 1353, "wolverines": 2860, "signal": 2360, "case": 472, "draft": 846, "grade": 1162, "11": 10, "players": 1957, "clear": 528, "actually": 102, "currently": 742, "class": 525, "updated": 2732, "com nfl": 614, "11 players": 11, "high": 1230, "yield": 2898, "rates": 2105, "math": 1606, "help": 1222, "decide": 773, "worth": 2881, "high yield": 1233, "yield savings": 2899, "pegula": 1908, "leads": 1460, "improve": 1295, "wta": 2887, "tour": 2646, "calendar": 438, "jessica": 1382, "lead": 1454, "panel": 1871, "improvements": 1298, "rankings": 2100, "event": 936, "requirements": 2169, "com pegula": 618, "pegula leads": 1910, "leads push": 1461, "push improve": 2065, "improve wta": 1296, "wta tour": 2889, "tour calendar": 2647, "calendar american": 439, "american tennis": 181, "tennis player": 2598, "player jessica": 1955, "jessica pegula": 1383, "pegula lead": 1909, "lead new": 1455, "new 13": 1746, "13 person": 15, "person panel": 1920, "panel tasked": 1872, "tasked making": 2575, "making improvements": 1572, "improvements wta": 1299, "wta calendar": 2888, "calendar rankings": 440, "rankings event": 2101, "event requirements": 937, "growth": 1175, "investing": 1344, "capacity": 453, "weeks": 2822, "extended": 960, "spell": 2425, "added": 108, "injury": 1328, "report": 2161, "following": 1046, "fractured": 1066, "17": 23, "proven": 2056, "model": 1670, "sportsline": 2437, "simulated": 2367, "bulldogs": 417, "revealed": 2187, "south": 2417, "conference": 670, "matchup": 1603, "odds prediction": 1786, "prediction time": 2004, "time 2026": 2624, "picks february": 1936, "february 17": 1002, "17 proven": 24, "proven model": 2057, "model sportsline": 1673, "sportsline model": 2438, "model simulated": 1672, "tuesday revealed": 2689, "revealed college": 2188, "college basketball": 547, "basketball picks": 292, "picks big": 1934, "golf": 1154, "bags": 273, "according": 88, "pros": 2053, "hit": 1247, "links": 1501, "com 11": 555, "rfk": 2196, "jr": 1398, "overhaul": 1857, "baby": 269, "formula": 1060, "administration": 115, "expected": 947, "operation": 1832, "speed": 2424, "unlikely": 2726, "seed": 2307, "rfk jr": 2197, "agreed": 129, "work": 2871, "japan": 1372, "mexico": 1631, "union": 2720, "critical": 731, "used": 2744, "defense": 781, "china": 511, "dominance": 835, "sector": 2302, "backed": 270, "stopped": 2496, "stocks": 2494, "losses": 1529, "moved": 1697, "com stocks": 631, "profit": 2041, "economic": 873, "industry": 1318, "rivals": 2211, "pay": 1897, "hidden": 1228, "government": 1160, "funding": 1088, "born": 377, "details": 795, "payments": 1901, "beijing": 302, "bureau": 422, "skiing": 2384, "accidentally": 86, "quickly": 2084, "scrubbed": 2285, "budget": 410, "com hidden": 592, "hidden government": 1229, "government funding": 1161, "funding china": 1089, "china american": 512, "american born": 176, "born olympic": 378, "olympic star": 1814, "star details": 2462, "details payments": 796, "payments beijing": 1902, "beijing sports": 303, "sports bureau": 2435, "bureau freestyle": 423, "freestyle skiing": 1078, "skiing champion": 2385, "champion eileen": 491, "gu accidentally": 1177, "accidentally revealed": 87, "revealed year": 2189, "year quickly": 2896, "quickly scrubbed": 2085, "scrubbed budget": 2286, "jobs": 1390, "picture": 1937, "reflects": 2132, "surging": 2533, "demand": 789, "social": 2405, "environment": 916, "factory": 975, "workers": 2874, "economies": 876, "keeps": 1406, "tiny": 2628, "country": 715, "wants": 2785, "nation": 1716, "population": 1983, "minnesota": 1658, "winning": 2851, "softbank": 2407, "openai": 1827, "bet": 315, "largest": 1441, "son": 2408, "risk": 2210, "mountaineering": 1696, "hype": 1283, "tiktok": 2622, "broadcaster": 399, "ski mountaineering": 2383, "using": 2747, "hospital": 1262, "suspended": 2542, "care": 457, "complex": 667, "month": 1682, "called": 441, "antofagasta": 211, "books": 369, "driven": 850, "metal": 1628, "miner": 1655, "2025": 35, "50": 65, "com antofagasta": 564, "antofagasta books": 212, "books record": 370, "record earnings": 2125, "earnings driven": 866, "driven higher": 851, "higher metal": 1235, "metal prices": 1629, "prices miner": 2025, "miner 2025": 1656, "2025 earnings": 36, "earnings rose": 868, "rose 50": 2229, "50 year": 66, "200": 31, "troops": 2678, "train": 2659, "won": 2866, "officials": 1798, "say": 2274, "division": 817, "customers": 744, "airlines": 151, "banks": 277, "turn": 2693, "technology": 2593, "inventory": 1340, "elite": 899, "quarterback": 2077, "acc": 83, "passing": 1890, "transfer": 2663, "lawsuit": 1453, "contract": 692, "wr": 2882, "longer": 1518, "young": 2905, "receiver": 2120, "arrested": 230, "wide receiver": 2835, "starmer": 2470, "fall": 980, "epstein": 918, "scandal": 2279, "landslide": 1437, "election": 893, "19": 27, "months": 1686, "ago": 128, "epstein scandal": 921, "venezuela": 2761, "treasury": 2670, "department": 792, "issued": 1361, "friday": 1080, "including": 1303, "operate": 1831, "crypto": 737, "deep": 775, "ramp": 2094, "ambitions": 169, "bediako": 299, "ruling": 2242, "means": 1613, "eligibility": 897, "browns": 408, "safety": 2257, "ronnie": 2225, "hickman": 1227, "injuries": 1326, "assaulted": 237, "monday": 1677, "reportedly": 2164, "manhattan": 1581, "hotel": 1266, "lobby": 1510, "morning": 1693, "com browns": 577, "safety ronnie": 2258, "ronnie hickman": 2226, "early monday": 864, "monday morning": 1678, "fund": 1086, "maritime": 1585, "proposals": 2051, "awaited": 265, "action": 98, "plan": 1941, "require": 2167, "congressional": 677, "proposals long": 2052, "long awaited": 1515, "awaited maritime": 266, "maritime action": 1586, "action plan": 99, "plan require": 1942, "require congressional": 2168, "congressional action": 678, "eala": 861, "completes": 664, "remarkable": 2153, "comeback": 643, "abu": 81, "dhabi": 801, "alex": 156, "produced": 2036, "stunning": 2512, "quarterfinals": 2078, "abu dhabi": 82, "alex eala": 157, "dhabi open": 802, "defector": 777, "explains": 954, "remote": 2155, "scam": 2277, "helping": 1225, "north": 1770, "korea": 1427, "nukes": 1778, "kim": 1415, "jong": 1395, "cyber": 747, "operatives": 1833, "faked": 976, "firms": 1033, "pocketing": 1966, "regime": 2134, "com defector": 583, "defector explains": 778, "explains remote": 955, "remote work": 2156, "work scam": 2872, "scam helping": 2278, "helping north": 1226, "north korea": 1772, "korea pay": 1428, "pay nukes": 1898, "nukes kim": 1779, "kim jong": 1416, "jong cyber": 1396, "cyber operatives": 748, "operatives faked": 1834, "faked way": 977, "way jobs": 2808, "jobs american": 1391, "american firms": 177, "firms pocketing": 1034, "pocketing big": 1967, "big revenue": 328, "revenue regime": 2194, "knockout": 1421, "preview": 2019, "matches": 1602, "league knockout": 1468, "strikes": 2503, "10": 3, "deal": 764, "maker": 1567, "stand": 2458, "10 billion": 5, "billion deal": 340, "sacramento": 2255, "state": 2477, "spend": 2427, "tens": 2599, "millions": 1654, "join": 1392, "mac": 1547, "putting": 2068, "university": 2725, "price": 2021, "25": 55, "million": 1653, "compete": 659, "left": 1482, "inside": 1329, "outside": 1854, "sacramento state": 2256, "questions": 2083, "figure": 1013, "skater": 2375, "debut": 769, "18": 25, "ties": 2620, "coaches": 540, "center": 481, "figure skater": 1014, "coming": 645, "documents": 823, "mood": 1687, "replace": 2160, "considered": 680, "ap": 213, "poll": 1980, "com michigan": 604, "men college": 1625, "supplies": 2529, "countries": 714, "caribbean": 460, "island": 1358, "economists": 879, "little": 1503, "crisis": 728, "fantasy": 988, "running": 2245, "projections": 2045, "backs": 271, "com fantasy": 586, "2026 fantasy": 41, "shot": 2355, "scoring": 2282, "guard": 1178, "played": 1953, "york": 2903, "title": 2630, "1970s": 29, "style": 2513, "new york": 1755, "regulator": 2137, "rule": 2240, "change": 497, "chinese": 515, "follow": 1045, "accounting": 92, "rules": 2241, "carnival": 464, "city": 519, "street": 2501, "come": 642, "far": 989, "anderson": 189, "cooper": 697, "leaving": 1477, "60": 69, "statement": 2480, "correspondent": 706, "cnn": 536, "program": 2043, "children": 510, "com anderson": 562, "anderson cooper": 190, "60 minutes": 70, "spend time": 2428, "lillard": 1495, "message": 1627, "adding": 109, "portland": 1986, "trail": 2657, "blazers": 350, "trail blazers": 2658, "trip": 2675, "expresses": 959, "interview": 1337, "included": 1302, "slip": 2394, "ups": 2734, "munich": 1702, "munich security": 1703, "security conference": 2306, "lost": 1530, "opportunity": 1845, "100 000": 8, "goldman": 1150, "sachs": 2252, "scrap": 2283, "dei": 784, "criteria": 729, "sexual": 2329, "orientation": 1850, "types": 2699, "factors": 973, "taken": 2553, "governance": 1158, "identifies": 1287, "potential": 1991, "directors": 811, "com goldman": 589, "goldman sachs": 1151, "sachs plans": 2254, "plans scrap": 1946, "scrap dei": 2284, "dei criteria": 785, "criteria board": 730, "board race": 357, "race sexual": 2087, "sexual orientation": 2330, "orientation types": 1851, "types dei": 2700, "dei factors": 786, "factors longer": 974, "longer taken": 1519, "taken account": 2554, "account board": 90, "board governance": 355, "governance committee": 1159, "committee identifies": 648, "identifies new": 1288, "new potential": 1752, "potential directors": 1992, "71": 74, "celtics": 480, "turning": 2697, "tv": 2698, "ranks": 2102, "star dies": 2463, "dies 71": 808, "high school": 1232, "qb": 2071, "hearing": 1218, "judge": 1399, "soon": 2409, "court": 719, "inflation": 1320, "index": 1308, "january": 1370, "consumer price": 685, "clippers": 530, "investigation": 1343, "fully": 1085, "brands": 388, "slows": 2399, "burger": 424, "king": 1418, "stay": 2483, "slowing": 2398, "pace": 1861, "construction": 683, "materials": 1605, "force": 1050, "locations": 1511, "expanding": 943, "fallout": 983, "files": 1019, "epstein files": 919, "dies 84": 809, "suspect": 2539, "killed": 1412, "police": 1974, "believe": 304, "related": 2141, "family": 986, "threat": 2617, "com people": 620, "hockey game": 1251, "crackdown": 724, "targeting": 2570, "politicians": 1979, "members": 1621, "movement": 1698, "islamic": 1357, "com iran": 596, "pentagon": 1912, "maduro": 1552, "raid": 2088, "palantir": 1868, "highlights": 1238, "role": 2220, "com pentagon": 619, "pentagon used": 1913, "used anthropic": 2745, "anthropic claude": 209, "claude maduro": 527, "maduro venezuela": 1553, "venezuela raid": 2762, "raid use": 2089, "use model": 2742, "model contract": 1671, "contract palantir": 693, "palantir highlights": 1869, "highlights growing": 1239, "growing role": 1174, "role ai": 2221, "ai pentagon": 139, "coalition": 541, "poor": 1982, "seeking": 2308, "wc": 2810, "qualifiers": 2074, "forward": 1062, "wc qualifiers": 2811, "qualifiers squad": 2075, "national team": 1718, "economy": 880, "thing": 2610, "remained": 2149, "constant": 682, "focused": 1043, "close": 532, "edge": 882, "spending": 2429, "wealth": 2813, "rise": 2206, "talking": 2563, "shoes": 2349, "lighter": 1492, "easier": 869, "matter": 1608, "com best": 569, "slightly": 2393, "sharply": 2338, "fell sharply": 1007, "industrial": 1316, "partners": 1881, "county": 718, "reduced": 2129, "competition": 661, "engines": 907, "com los": 601, "dollar": 829, "decline": 774, "despite": 794, "signs": 2363, "likely": 1494, "period": 1918, "labor market": 1432, "monthly": 1684, "temperatures": 2596, "com home": 593, "sales fell": 2266, "blade": 348, "angels": 196, "final": 1021, "alysa": 163, "liu": 1504, "glenn": 1140, "short": 2353, "olympics blade": 1818, "blade angels": 349, "alysa liu": 164, "women figure": 2862, "figure skating": 1016, "skating short": 2379, "short program": 2354, "india": 1311, "adani": 105, "group": 1170, "invest": 1341, "infrastructure": 1323, "conglomerate": 674, "boost": 372, "artificial": 233, "intelligence": 1334, "com india": 594, "india adani": 1312, "adani group": 106, "group invest": 1171, "invest 100": 1342, "100 billion": 9, "billion ai": 338, "ai infrastructure": 137, "infrastructure conglomerate": 1324, "conglomerate investment": 675, "investment boost": 1346, "boost country": 373, "country ambitions": 716, "ambitions global": 170, "global leader": 1142, "leader artificial": 1457, "artificial intelligence": 234, "club": 534, "jeffrey": 1375, "problem": 2035, "core": 702, "jeffrey epstein": 1376, "movie": 1701, "night": 1764, "parents": 1876, "reduce": 2128, "phones": 1928, "kids": 1411, "nhl": 1763, "host": 1263, "com olympic": 615, "olympic hockey": 1813, "hockey team": 1252, "wizard": 2856, "novak": 1774, "djokovic": 820, "shocks": 2348, "jannik": 1368, "sinner": 2370, "magic": 1554, "38": 62, "rallies": 2093, "defeat": 776, "defending": 780, "sets": 2324, "novak djokovic": 1775, "jannik sinner": 1369, "open final": 1826, "38 year": 63, "remember": 2154, "dance": 750, "era": 923, "ice dance": 1285, "fiba": 1010, "15": 18, "cup qualifiers": 739, "15 players": 19, "chris": 517, "secretary": 2301, "robert": 2214, "midterms": 1642, "removed": 2157, "roles": 2222, "com chris": 580, "shares": 2337, "string": 2504, "drugmaker": 858, "general": 1109, "buy": 430, "pacificorp": 1863, "assets": 240, "electric": 895, "struck": 2507, "wind": 2846, "natural": 1719, "generation": 1114, "distribution": 815, "berkshire": 309, "hathaway": 1196, "unit": 2721, "com portland": 622, "portland general": 1987, "general buy": 1110, "buy pacificorp": 431, "pacificorp washington": 1865, "washington assets": 2796, "assets billion": 242, "billion portland": 342, "general electric": 1111, "electric struck": 896, "struck deal": 2508, "deal buy": 765, "buy wind": 432, "wind natural": 2847, "natural gas": 1720, "gas generation": 1105, "generation distribution": 1116, "distribution assets": 816, "assets berkshire": 241, "berkshire hathaway": 310, "hathaway pacificorp": 1197, "pacificorp unit": 1864, "unit washington": 2722, "washington state": 2797, "state billion": 2478, "german": 1125, "sentiment": 2317, "confidence": 671, "investors": 1348, "fragile": 1068, "rebound": 2118, "com german": 588, "europe largest": 933, "largest economy": 1442, "victory": 2769, "match": 1599, "season post": 2290, "schedule": 2280, "leaders": 1458, "com olympics": 616, "knockout round": 1422, "guides": 1180, "look": 1522, "cruel": 736, "quad": 2072, "god": 1146, "ilia": 1291, "malinin": 1574, "instead": 1332, "performance": 1916, "milan": 1646, "quad god": 2073, "ilia malinin": 1292, "ready": 2113, "legislation": 1486, "road": 2213, "congress": 676, "objections": 1782, "coinbase": 543, "pga": 1922, "doors": 844, "liv": 1505, "brooks": 401, "koepka": 1426, "offering": 1793, "com pga": 621, "pga tour": 1923, "brooks koepka": 402, "track": 2649, "fifth": 1011, "league appeared": 1464, "job": 1388, "dolphins": 830, "release": 2142, "tyreek": 2702, "hill": 1241, "miami": 1634, "cut": 745, "remain": 2148, "franchise": 1069, "com did": 584, "dolphins release": 831, "tyreek hill": 2703, "online": 1824, "store": 2497, "held": 1221, "knicks": 1420, "87": 79, "decades": 771, "madison": 1550, "easy": 871, "premier": 2007, "walk": 2777, "park": 1879, "league easy": 1466, "easy premier": 872, "premier league": 2008, "league teams": 1471, "teams champions": 2586, "league walk": 1472, "walk park": 2778, "park premier": 1880, "run": 2244, "lines": 1500, "revamp": 2185, "small": 2400, "tony": 2638, "clark": 524, "resign": 2171, "cba": 477, "federal": 1003, "licensing": 1490, "com mlb": 607, "tony clark": 2639, "midterm": 1640, "elections": 894, "approach": 222, "file": 1018, "republicans": 2166, "starting": 2476, "independence": 1306, "midterm elections": 1641, "moments": 1675, "davis": 755, "dominating": 836, "tom": 2636, "improbable": 1294, "returned": 2181, "favorite": 996, "olympic gold": 1812, "released": 2143, "moves": 1700, "salary": 2264, "space": 2420, "hire": 1242, "seahawks": 2287, "oc": 1783, "andrew": 193, "offensive": 1788, "coordinator": 698, "oc seahawks": 1784, "offensive coordinator": 1789, "dodgers": 825, "series": 2320, "highest": 1237, "paid": 1866, "baseball": 283, "world series": 2879, "upset": 2735, "worst": 2880, "performances": 1917, "slipped": 2395, "live": 1507, "stream": 2499, "face": 969, "daunting": 754, "wasn": 2798, "saw": 2273, "surprising": 2536, "130": 16, "january job": 1371, "job market": 1389, "130 000": 17, "000 jobs": 1, "unrivaled": 2730, "path": 1893, "offers": 1795, "format": 1059, "aims": 144, "bring": 398, "com unrivaled": 637, "best players": 314, "500": 67, "share": 2334, "shareholders": 2336, "today": 2632, "free": 1072, "com watch": 639, "day 10": 757, "need know": 1738, "spot": 2439, "boom": 371, "com big": 572, "big tech": 329, "ai boom": 133, "holds": 1256, "steady": 2485, "annual": 201, "unchanged": 2711, "meeting": 1619, "holds steady": 1257, "annual inflation": 202, "owner": 1859, "mark": 1587, "tanking": 2567, "isn": 1359, "experts": 952, "mvp": 1707, "asked": 236, "language": 1438, "skills": 2387, "sectors": 2303, "opinion america": 1838, "america needs": 172, "needs ai": 1740, "ai math": 138, "math language": 1607, "language skills": 1439, "skills won": 2388, "won stay": 2869, "stay ahead": 2484, "ahead china": 131, "china economic": 513, "economic sectors": 875, "sectors matter": 2304, "deploy": 793, "philippines": 1926, "commitment": 646, "key": 1409, "asian": 235, "plans deploy": 1944, "rodman": 2217, "headlines": 1209, "uswnt": 2753, "shebelieves": 2339, "trinity": 2673, "heaps": 1215, "lavelle": 1450, "manager": 1577, "emma": 900, "hayes": 1201, "com rodman": 625, "rodman headlines": 2218, "headlines uswnt": 1210, "uswnt shebelieves": 2754, "shebelieves roster": 2341, "roster trinity": 2233, "trinity rodman": 2674, "rodman lindsey": 2219, "lindsey heaps": 1497, "heaps rose": 1216, "rose lavelle": 2230, "lavelle headline": 1451, "headline women": 1208, "women national": 2864, "team roster": 2582, "roster announced": 2232, "announced tuesday": 199, "tuesday manager": 2688, "manager emma": 1578, "emma hayes": 901, "hayes shebelieves": 1202, "shebelieves cup": 2340, "jaylen": 1373, "brown": 406, "considering": 681, "transition": 2664, "jaylen brown": 1374, "nba career": 1727, "offseason": 1799, "upgrade": 2733, "mets": 1630, "borrowing": 379, "borrowing costs": 380, "unc": 2708, "wilson": 2838, "adjusting": 113, "cast": 473, "carolina": 465, "caleb": 436, "learning": 1475, "non": 1768, "inching": 1300, "returning": 2182, "suffering": 2521, "com unc": 636, "unc wilson": 2709, "wilson adjusting": 2839, "adjusting cast": 114, "cast return": 475, "return soon": 2180, "soon north": 2410, "north carolina": 1771, "carolina star": 466, "star caleb": 2461, "caleb wilson": 437, "wilson learning": 2840, "learning play": 1476, "play cast": 1952, "cast non": 474, "non shooting": 1769, "shooting hand": 2352, "hand inching": 1189, "inching returning": 1301, "returning soon": 2183, "soon suffering": 2411, "suffering fractured": 2522, "fractured left": 1067, "left hand": 1483, "better": 318, "aging": 127, "land": 1434, "don want": 839, "republican": 2165, "led": 1480, "passed": 1889, "longstanding": 1520, "citizenship": 518, "jim": 1386, "elana": 891, "meyers": 1632, "taylor": 2577, "wins": 2852, "pairs": 1867, "extends": 963, "unexpected": 2717, "stage": 2453, "elana meyers": 892, "meyers taylor": 1633, "milan cortina": 1647, "st": 2449, "seasons": 2291, "york city": 2904, "seattle": 2292, "choice": 516, "noahkai": 1766, "usmnt": 2748, "strong": 2505, "form": 1057, "augsburg": 255, "bundesliga": 420, "mauricio": 1609, "pochettino": 1964, "meet noahkai": 1618, "noahkai banks": 1767, "banks 19": 278, "19 outside": 28, "outside pick": 1855, "pick make": 1930, "make usmnt": 1566, "usmnt world": 2750, "cup squad": 740, "squad noahkai": 2445, "banks strong": 279, "strong form": 2506, "form augsburg": 1058, "augsburg bundesliga": 256, "bundesliga just": 421, "just mauricio": 1402, "mauricio pochettino": 1610, "pochettino usmnt": 1965, "usmnt squad": 2749, "squad world": 2446, "cup starter": 741, "middle": 1638, "strategy": 2498, "sky": 2389, "delhi": 787, "powered": 1996, "deals": 766, "new delhi": 1748, "shutdown": 2357, "review": 2195, "double": 845, "trouble": 2679, "philly": 1927, "philadelphia": 1924, "76ers": 77, "philadelphia 76ers": 1925, "gen": 1108, "majority": 1558, "hits": 1248, "sent": 2316, "walker": 2779, "later": 1444, "based": 285, "life": 1491, "thomas": 2612, "blockbuster": 353, "streaming": 2500, "candy": 451, "got": 1157, "product": 2037, "heisman": 1220, "opens": 1830, "2026 heisman": 43, "arsenal": 231, "place": 1940, "glut": 1143, "manchester": 1579, "title race": 2631, "manchester city": 1580, "code": 542, "military": 1651, "journey": 1397, "com military": 606, "trump administration": 2683, "builds": 413, "norwegian": 1773, "line": 1499, "com activist": 558, "concerns": 669, "typically": 2701, "arenas": 227, "ice hockey": 1286, "auto": 259, "amp": 185, "transport": 2666, "roundup": 2235, "insight": 1330, "trucking": 2680, "latest": 1445, "covering": 720, "com auto": 566, "auto amp": 260, "amp transport": 186, "transport roundup": 2667, "roundup market": 2236, "market talk": 1592, "talk insight": 2561, "latest market": 1447, "market talks": 1593, "talks covering": 2565, "covering auto": 721, "auto transport": 262, "kathy": 1404, "ruemmler": 2237, "reached": 2108, "breaking": 390, "unease": 2715, "grew": 1168, "document": 821, "releases": 2144, "resignation": 2172, "weiss": 2825, "chairman": 488, "com kathy": 599, "kathy ruemmler": 1405, "ruemmler goldman": 2238, "sachs finally": 2253, "finally reached": 1024, "reached breaking": 2109, "breaking point": 391, "point unease": 1970, "unease board": 2716, "board members": 356, "members grew": 1622, "grew following": 1169, "following latest": 1047, "latest document": 1446, "document releases": 822, "releases resignation": 2145, "resignation paul": 2173, "paul weiss": 1896, "weiss chairman": 2826, "agent": 123, "ranking": 2098, "kenneth": 1407, "iii": 1289, "bowl mvp": 386, "free agent": 1074, "kenneth walker": 1408, "walker iii": 2780, "starlink": 2469, "terminals": 2603, "effort": 885, "tehran": 2594, "stifling": 2491, "access": 85, "sterling": 2489, "data": 751, "weak": 2812, "boosted": 374, "march": 1583, "options": 1847, "weighing": 2823, "battle": 293, "housing": 1274, "lawmakers": 1452, "jet": 1384, "powering": 1999, "centers": 482, "converting": 695, "aircraft": 147, "turbines": 2690, "com jet": 598, "jet engines": 1385, "engines powering": 909, "powering data": 2000, "data centers": 752, "centers companies": 483, "companies converting": 654, "converting aircraft": 696, "aircraft engines": 149, "engines land": 908, "land based": 1435, "based natural": 287, "gas turbines": 1106, "turbines power": 2691, "power generation": 1994, "generation ai": 1115, "bonds": 367, "enter": 911, "yields": 2902, "com government": 590, "political risk": 1978, "sign": 2359, "bridge": 394, "drivers": 852, "recent": 2121, "research": 2170, "attention": 254, "confusing": 673, "exit": 942, "buffalo": 411, "sends": 2314, "border": 375, "com new": 613, "trading": 2655, "equity": 922, "presidents": 2016, "lunar": 1544, "closed": 533, "lunar new": 1545, "new year": 1754, "vcs": 2758, "beating": 297, "tough": 2644, "fundraising": 1090, "venture": 2764, "capitalists": 455, "struggling": 2510, "entice": 914, "skeptical": 2380, "handful": 1190, "succeeding": 2515, "com healthcare": 591, "healthcare vcs": 1214, "vcs beating": 2759, "beating tough": 298, "tough fundraising": 2645, "fundraising market": 1091, "market venture": 1594, "venture capitalists": 2765, "capitalists focused": 456, "focused health": 1044, "health struggling": 1212, "struggling entice": 2511, "entice skeptical": 915, "skeptical investors": 2381, "investors handful": 1349, "handful succeeding": 1191, "surprises": 2535, "tournament": 2648, "heading": 1205, "immigration": 1293, "sources": 2414, "tight": 2621, "ends": 905, "told": 2634, "com sources": 629, "sources seahawks": 2415, "sources told": 2416, "told espn": 2635, "great": 1166, "let": 1487, "22": 50, "spain": 2421, "remains": 2152, "overall": 1856, "beretta": 307, "gun": 1181, "dynasty": 859, "oldest": 1806, "firearms": 1029, "aim": 140, "amassing": 165, "rifle": 2200, "ruger": 2239, "com 500": 557, "500 year": 68, "old beretta": 1805, "beretta gun": 308, "gun dynasty": 1182, "dynasty betting": 860, "betting big": 320, "big world": 330, "world oldest": 2878, "oldest firearms": 1807, "firearms business": 1030, "business taking": 426, "taking aim": 2559, "aim biggest": 141, "biggest american": 332, "american rivals": 179, "rivals amassing": 2212, "amassing 10": 166, "10 stake": 6, "stake rifle": 2455, "rifle maker": 2201, "maker ruger": 1568, "swings": 2545, "amid": 184, "reported": 2162, "confirms": 672, "upcoming": 2731, "joint": 1394, "efforts": 886, "create": 726, "begins": 301, "quest": 2081, "singles": 2369, "olympics american": 1817, "quest gold": 2082, "check": 501, "funds": 1092, "holdings": 1255, "com china": 579, "puts": 2067, "climbed": 529, "young people": 2906, "second": 2296, "rumors": 2243, "news": 1758, "eye": 964, "shock": 2347, "liverpool": 1508, "williams": 2837, "brought": 405, "crown": 734, "led seattle": 1481, "skaters": 2376, "figure skaters": 1015, "mild": 1650, "outlook": 1852, "forecast": 1053, "heating": 1219, "french": 1079, "issue": 1360, "giants": 1134, "giveaway": 1136, "blitz": 351, "developers": 798, "tea": 2578, "cars": 470, "robots": 2215, "promotions": 2046, "aimed": 142, "locking": 1512, "users": 2746, "bowl ai": 384, "ai giants": 136, "giants turn": 1135, "turn china": 2694, "china lunar": 514, "year giveaway": 2894, "giveaway blitz": 1137, "blitz ai": 352, "ai developers": 135, "developers offering": 799, "offering free": 1794, "free tea": 1075, "tea free": 2579, "free use": 1076, "use cars": 2740, "cars robots": 471, "robots promotions": 2216, "promotions aimed": 2047, "aimed locking": 143, "locking users": 1513, "date": 753, "miss": 1661, "priority": 2027, "31": 59, "antetokounmpo": 205, "nba title": 1730, "31 year": 60, "giannis antetokounmpo": 1132, "central": 484, "cuts": 746, "lowered": 1538, "sixth": 2373, "consecutive": 679, "continued": 691, "approaches": 223, "com russia": 627, "central bank": 485, "key rate": 1410, "sixth consecutive": 2374, "payment": 1900, "protests": 2055, "activity": 101, "tags": 2549, "tag": 2546, "seahawks unlikely": 2288, "unlikely use": 2727, "use tags": 2743, "tags walker": 2550, "walker seahawks": 2781, "use franchise": 2741, "franchise transition": 1071, "transition tag": 2665, "tag running": 2547, "running super": 2246, "mvp kenneth": 1709, "iii league": 1290, "league sources": 1470, "going": 1147, "com alcaraz": 560, "helped": 1224, "getting": 1128, "triggered": 2672, "eligible": 898, "feb": 999, "23": 51, "plans revealed": 1945, "professional tennis": 2040, "pritzker": 2028, "retires": 2177, "hyatt": 1279, "hotelier": 1267, "communicated": 650, "ghislaine": 1129, "maxwell": 1611, "com thomas": 634, "thomas pritzker": 2613, "pritzker named": 2029, "named epstein": 1711, "files retires": 1020, "retires hyatt": 2178, "hyatt executive": 1280, "executive chairman": 940, "chairman hotelier": 489, "hotelier communicated": 1268, "communicated jeffrey": 651, "epstein ghislaine": 920, "ghislaine maxwell": 1130, "fiscal": 1035, "fewer": 1009, "consumer sentiment": 686, "partnership": 1882, "target": 2568, "cancer": 450, "sec": 2293, "love": 1532, "award": 267, "gets": 1127, "publisher": 2059, "indexes": 1310, "survey": 2538, "finds": 1027, "rising": 2209, "concern": 668, "weather": 2814, "large": 1440, "monday night": 1679, "fedex": 1004, "targets": 2571, "margin": 1584, "higher revenue": 1236, "agent time": 124, "time career": 2625, "heard": 1217, "wnba": 2857, "complete": 662, "slams": 2391, "career grand": 459, "complete career": 663, "ceos": 487, "40": 64, "musk": 1706, "viral": 2771, "stanford": 2459, "app": 216, "bhp": 321, "asset": 238, "copper": 700, "expansion": 944, "opportunities": 1843, "unlock": 2728, "value": 2755, "portfolio": 1984, "deadline": 762, "generating": 1112, "com bhp": 571, "bhp targets": 323, "targets 10": 2572, "billion asset": 339, "asset sales": 239, "sales help": 2267, "help fund": 1223, "fund copper": 1087, "copper expansion": 701, "expansion bhp": 945, "bhp group": 322, "group said": 1172, "said opportunities": 2261, "opportunities unlock": 1844, "unlock value": 2729, "value portfolio": 2756, "portfolio assets": 1985, "assets won": 243, "won deadline": 2867, "deadline target": 763, "target generating": 2569, "generating 10": 1113, "billion deals": 341, "ve": 2760, "harden": 1194, "james harden": 1367, "comes": 644, "changes": 499, "2026 college": 39, "navy": 1724, "ships": 2345, "collide": 550, "waters": 2804, "near": 1734, "vessels": 2766, "assigned": 244, "buildup": 414, "collided": 552, "ship": 2342, "refueling": 2133, "com navy": 611, "navy ships": 1725, "ships collide": 2346, "collide waters": 551, "waters near": 2805, "near south": 1735, "south america": 2419, "america people": 173, "people reported": 1915, "reported injuries": 2163, "injuries vessels": 1327, "vessels assigned": 2767, "assigned military": 245, "military buildup": 1652, "buildup caribbean": 415, "caribbean collided": 461, "collided ship": 553, "ship ship": 2344, "ship refueling": 2343, "lakers": 1433, "welcome": 2827, "angeles lakers": 195, "carried": 467, "mayor": 1612, "wasserman": 2799, "2028": 49, "expects": 948, "75": 75, "75 million": 76, "bracketology": 387, "uconn": 2704, "houston": 1275, "east": 870, "fcs": 997, "league football": 1467, "tax": 2576, "half": 1183, "claims": 523, "pro": 2031, "golfer": 1155, "18 year": 26, "fitness": 1036, "goals": 1145, "prediction 2026": 2002, "picks feb": 1935, "feb 17": 1000, "state vs": 2479, "picks acc": 1933, "acc matchup": 84, "takeaways": 2552, "criticism": 732, "exploded": 956, "gains": 1097, "far fewer": 990, "stats": 2482, "baseball season": 284, "buster": 428, "olney": 1808, "entering": 912, "position": 1988, "buster olney": 429, "olney ranks": 1809, "entering 2026": 913, "ataman": 246, "gave": 1107, "panathinaikos": 1870, "warner": 2790, "reopens": 2158, "paramount": 1873, "sweetened": 2543, "offer": 1790, "bros": 403, "discovery": 812, "seven": 2327, "window": 2848, "takeover": 2555, "com warner": 638, "warner reopens": 2792, "reopens talks": 2159, "talks paramount": 2566, "paramount sweetened": 1875, "sweetened offer": 2544, "offer warner": 1792, "warner bros": 2791, "bros discovery": 404, "discovery board": 813, "board sets": 358, "sets seven": 2325, "seven day": 2328, "day window": 758, "window paramount": 2849, "paramount make": 1874, "make best": 1561, "best final": 313, "final takeover": 1022, "takeover offer": 2556, "monaco": 1676, "euroleague": 931, "success": 2516, "paris": 1877, "2024": 34, "bid": 324, "napa": 1714, "genuine": 1119, "parts": 1883, "split": 2430, "preparing": 2010, "separate": 2318, "com napa": 609, "napa owner": 1715, "owner genuine": 1860, "genuine parts": 1120, "parts plans": 1886, "plans split": 1947, "split companies": 2431, "companies company": 653, "company preparing": 657, "preparing separate": 2011, "separate auto": 2319, "auto parts": 261, "parts industrial": 1885, "industrial parts": 1317, "parts businesses": 1884, "breanna": 392, "stewart": 2490, "turkey": 2692, "breanna stewart": 393, "trades": 2653, "barnwell": 280, "homes": 1260, "dj": 818, "moore": 1691, "afc": 119, "west": 2830, "kyler": 1429, "murray": 1704, "offense": 1787, "11 trades": 12, "trades want": 2654, "want offseason": 2783, "offseason barnwell": 1800, "barnwell finds": 281, "finds new": 1028, "new homes": 1750, "homes 15": 1261, "players dj": 1958, "dj moore": 819, "moore brown": 1692, "brown afc": 407, "afc west": 120, "west kyler": 2831, "kyler murray": 1430, "murray new": 1705, "new offense": 1751, "mike": 1643, "patience": 1894, "announces": 200, "rely": 2147, "pacific": 1862, "eurozone": 935, "retail": 2176, "sank": 2269, "december": 772, "end 2025": 903, "rejected": 2140, "favor": 995, "netflix": 1743, "wanted": 2784, "mad": 1548, "source": 2412, "hot": 1264, "killer": 1413, "speculate": 2423, "opinion profit": 1839, "profit mad": 2042, "mad market": 1549, "market source": 1591, "source hot": 2413, "hot air": 1265, "air spot": 146, "spot killer": 2440, "killer news": 1414, "news don": 1759, "don speculate": 838, "fellow": 1008, "goal": 1144, "throwing": 2618, "mix": 1665, "skill": 2386, "com america": 561, "ronaldo": 2223, "opponents": 1841, "domestic": 833, "wait": 2775, "aren": 224, "unheralded": 2718, "powerhouses": 1998, "com ronaldo": 626, "ronaldo opponents": 2224, "opponents lost": 1842, "lost domestic": 1531, "domestic match": 834, "match wait": 1601, "wait team": 2776, "team won": 2584, "won domestic": 2868, "match history": 1600, "history champions": 1246, "champions aren": 493, "aren based": 225, "based country": 286, "country league": 717, "football unheralded": 1049, "unheralded powerhouses": 2719, "moment": 1674, "natwest": 1721, "com financial": 587, "financial services": 1026, "services roundup": 2322, "covering financial": 722, "lands": 1436, "draw": 847, "bucks": 409, "second title": 2299, "fortune": 1061, "premium": 2009, "platform": 1950, "base": 282, "knows": 1425, "times": 2626, "fk": 1037, "qarabag": 2069, "remaining": 2150, "probably": 2032, "com arsenal": 565, "arsenal fk": 232, "fk qarabag": 1038, "qarabag team": 2070, "team left": 2581, "left won": 1484, "won win": 2870, "win champions": 2842, "league 24": 1463, "24 remaining": 53, "remaining teams": 2151, "teams shot": 2589, "shot champions": 2356, "league crown": 1465, "crown let": 735, "let talk": 1488, "talk win": 2562, "win thing": 2845, "thing probably": 2611, "probably won": 2033, "completing": 665, "completing career": 666, "protection": 2054, "laser": 1443, "faa": 968, "halt": 1187, "flights": 1041, "el": 889, "paso": 1888, "hours": 1269, "special": 2422, "reasons": 2117, "border protection": 376, "el paso": 890, "chicago": 506, "setting": 2326, "2026 season": 45, "forecasts": 1054, "warmer": 2788, "lowering": 1539, "brief": 395, "cold": 544, "com natural": 610, "gas futures": 1104, "futures start": 1096, "start week": 2473, "week lower": 2819, "lower natural": 1536, "futures lower": 1095, "lower weather": 1537, "weather forecasts": 2815, "forecasts turned": 1055, "turned warmer": 2696, "warmer long": 2789, "weekend lowering": 2821, "lowering outlook": 1540, "outlook demand": 1853, "demand brief": 790, "brief cold": 396, "cold spell": 545, "spell week": 2426, "leading": 1459, "supply": 2530, "highly": 1240, "wright": 2883, "polymarket": 1981, "adds": 112, "kind": 1417, "mobile": 1669, "carrier": 468, "paying": 1899, "traffic": 2656, "improved": 1297, "94": 80, "army": 229, "worked": 2873, "andre": 191, "snellings": 2402, "eric": 924, "moody": 1688, "com bets": 570, "bets make": 317, "make heading": 1563, "heading nba": 1206, "nba second": 1728, "second half": 2297, "half make": 1184, "make playoffs": 1564, "playoffs win": 1962, "win mvp": 2843, "mvp andre": 1708, "andre snellings": 192, "snellings eric": 2403, "eric moody": 925, "moody offer": 1689, "offer best": 1791, "picked": 1931, "orders": 1849, "increase": 1305, "start year": 2474, "poised": 1972, "medals": 1615, "bobsled": 360, "cortina games": 708, "really": 2116, "fastest": 992, "pecking": 1905, "order": 1848, "raised": 2092, "days": 759, "pecking order": 1906, "new era": 1749, "makes sense": 1570, "cornerstone": 703, "spurs": 2443, "tottenham": 2643, "holiday": 1258, "newest": 1756, "advantage": 118, "drone": 853, "cowboys": 723, "receive": 2119, "balloons": 274, "reinvented": 2138, "range": 2095, "launchers": 1448, "altitude": 161, "extending": 961, "surveillance": 2537, "reinvented long": 2139, "long range": 1516, "range drone": 2096, "drone launchers": 854, "launchers high": 1449, "high altitude": 1231, "altitude balloons": 162, "balloons extending": 275, "extending reach": 962, "reach ukrainian": 2107, "ukrainian attacks": 2707, "attacks american": 253, "american surveillance": 180, "founder": 1063, "haul": 1198, "indiana": 1314, "dc": 760, "defensive": 782, "defensive coordinator": 783, "owned": 1858, "genesis": 1117, "invitational": 1350, "signature": 2361, "2026 genesis": 42, "genesis invitational": 1118, "simulated genesis": 2368, "invitational 2026": 1351, "2026 10": 38, "10 000": 4, "000 times": 2, "times revealed": 2627, "signature event": 2362, "enemy": 906, "appears": 221, "determined": 797, "venezuelan": 2763, "injunction": 1325, "indian": 1313, "prime": 2026, "russian oil": 2250, "products": 2038, "additional": 110, "option": 1846, "chelsea": 505, "secessionist": 2294, "hands": 1192, "supporters": 2531, "thank": 2608, "rich": 2198, "alberta": 153, "referendum": 2130, "allies": 159, "cheering": 504, "canada secessionist": 448, "secessionist movement": 2295, "movement hands": 1699, "hands supporters": 1193, "supporters thank": 2532, "thank trump": 2609, "trump oil": 2684, "oil rich": 1802, "rich alberta": 2199, "alberta poised": 154, "poised hold": 1973, "hold independence": 1254, "independence referendum": 1307, "referendum year": 2131, "year american": 2893, "american president": 178, "president allies": 2013, "allies cheering": 160, "falcons": 978, "rutenberg": 2251, "hiring": 1244, "jeremy": 1378, "hire falcons": 1243, "falcons defensive": 979, "game coordinator": 1099, "coordinator mike": 699, "mike rutenberg": 1644, "bondi": 365, "beach": 296, "naveed": 1722, "akram": 152, "woke": 2859, "com bondi": 576, "bondi beach": 366, "naveed akram": 1723, "miracle": 1660, "wemby": 2828, "steps": 2488, "values": 2757, "common": 649, "2023": 33, "surprise": 2534, "georgia": 1121, "benefit": 305, "marketplaces": 1595, "frontier": 1081, "microsoft": 1636, "amazon": 167, "planting": 1948, "flags": 1039, "cottage": 712, "publishers": 2061, "com marketplaces": 602, "marketplaces frontier": 1596, "frontier publisher": 1082, "publisher deals": 2060, "deals ai": 767, "ai companies": 134, "companies microsoft": 655, "microsoft amazon": 1637, "amazon planting": 168, "planting flags": 1949, "flags new": 1040, "new cottage": 1747, "cottage industry": 713, "industry publishers": 1319, "publishers look": 2062, "look additional": 1523, "additional revenue": 111, "features": 998, "reading": 2112, "com consumer": 582, "monthly survey": 1685, "economic mood": 874, "titans": 2629, "com djokovic": 585, "hunting": 1276, "main": 1555, "com baseball": 567, "com college": 581, "college football": 548, "15 years": 20, "thoughts": 2615, "2026 nba": 44, "fired": 1031, "big 12": 326, "tested": 2606, "network": 1744, "iowa": 1354, "cyclones": 749, "com iowa": 595, "iowa state": 1355, "jersey": 1379, "ages": 125, "claim": 522, "england": 910, "com seahawks": 628, "ways": 2809, "avoid": 264, 